app/controllers/comments_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "rating", "product_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "Greatest ever!\r\n"], ["rating", 5], ["product_id", 1], ["user_id", 2], ["created_at", "2015-08-20 22:30:27.655975"], ["updated_at", "2015-08-20 22:30:27.655975"]]
---
  def create
    @product = Product.find(params[:product_id])
    @comment = @product.comments.new(comment_params)
    @comment.user = current_user

    respond_to do |format|
      if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
  def destroy
    @comment = Comment.find params[:id]
    authorize! :destroy, @comment # cancancan command, that will raise exception if current user is
                                  # not authorized to destroy the particular.

    @comment.destroy