app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name ILIKE '%%')
SELECT "products".* FROM "products"
---
  def index
    if params[:q]

      search_term = params[:q]
      @products = Product.where("name LIKE ?", "%#{search_term}%")
    else
      @products = Product.all

SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ?  ORDER BY created_at DESC LIMIT 5 OFFSET 0  [["product_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 3]]
---
  def show
    @comments = @product.comments.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 5)

INSERT INTO "products" ("name", "description", "image_url", "colour", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Test"], ["description", "test"], ["image_url", ""], ["colour", "test"], ["price", 19.75], ["created_at", "2015-08-20 22:23:26.614043"], ["updated_at", "2015-08-20 22:23:26.614043"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "name" = ?, "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Barbara's Photo"], ["image_url", "http://notredame.photoshelter.com/img/pixel.gif"], ["updated_at", "2015-08-20 23:31:09.296243"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)