app/controllers/users_controller.rb

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "Kate"], ["last_name", "Russell"], ["updated_at", "2015-08-30 14:29:28.359779"], ["id", 1]]